package com.example.day3;
import android.support.v7.app.ActionBarActivity;
import android.content.ContentValues;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;


public class DataActivity extends ActionBarActivity {
	static MySQLiteHelper myHelper;
	static public String []tdata={"银杏","枇杷","桃子","紫叶李","黄葛树","柳树","梨花","玉兰","竹子","石榴","枫叶","小叶榕","桑叶","杜英","栀子花"};
	static public String []intro={"银杏（Ginkgo biloba L.），为银杏科、银杏属落叶乔木，别名白果，公孙树，鸭脚树，蒲扇。" +
			"银杏是现存种子植物中最古老的孑遗植物。和它同纲的所有其他植物皆已灭绝，号称活化石。银杏出身在几亿年前，现存活在世的银杏稀少而分散，上百岁的老树已不多见。"+
            "叶互生，在长枝上辐射状散生，在短枝上3~5枚成簇生状，有细长的叶柄，扇形，两面淡绿色，无毛，有多数叉状并列细脉，在宽阔的顶缘多少具缺刻或2裂，宽5~8（~15）厘米，" +
            "具多数叉状并歹帕细脉。在长枝上散生，在短枝上簇生。它的叶脉形式为“二歧状分叉叶脉”。[1] 在长枝上常2裂，基部宽楔形，柄长3-10（多为5~8）厘米，幼树及萌生枝上的叶常较而深裂（叶片长达13厘米，宽15厘米），" +
            "有时裂片再分裂（这与较原始的化石种类之叶相似），叶在一年生长枝上螺旋状散生，在短枝上3~8叶呈簇生状，秋季落叶前变为黄色。",
            
            "枇杷，别名：芦橘、金丸、芦枝，拉丁文名：Eriobotrya japonica (Thunb.) Lindl。蔷薇科、枇杷属植物，枇杷原产中国东南部，"+
            "因叶子形状似琵琶乐器而名，其花可入药。树高3～5米，叶子大而长，厚而有茸毛，呈长椭圆形，状如琵琶。常绿小乔木，高约10米；小枝粗壮，黄褐色，"+
            "密生锈色或灰棕色绒毛。叶革质，披针形、倒披针形、倒卵形或椭圆状矩圆形，长12-30厘米，宽3-9厘米，先端急尖或渐尖，基部楔形或渐狭成叶柄，"+
            "边缘上部有疏锯齿，上面多皱，下面及叶柄密生灰棕色绒毛，侧脉11-21对；叶柄长6-10毫米。圆锥花序顶生，总花梗、花梗及萼筒外面皆密生锈色绒毛；"+
            "花白色，直径1.2-2厘米；花柱5，离生。梨果球形或矩圆形，直径2-5厘米，黄色或桔黄色。 分布在甘肃、陕西、河南、长江流域；越南，缅甸，印度，"+
            "印度尼西亚，日本也有。多为栽培或野生。果生食或酿酒；叶药用，能利尿、清热、止渴，枇杷仁及叶有镇咳作用。",
            
            "桃（学名：Amygdalus persica L.）：蔷薇科、桃属植物。落叶小乔木；叶为窄椭圆形至披针形，长15厘米，宽4厘米，先端成长而细的尖端，边缘有细齿，"+
            "暗绿色有光泽，叶基具有蜜腺；树皮暗灰色，随年龄增长出现裂缝；花单生，从淡至深粉红或红色，有时为白色，有短柄，直径4厘米，早春开花；近球形核果，表面有毛茸，"+
            "肉质可食，为橙黄色泛红色，直径7.5厘米，有带深麻点和沟纹的核，内含白色种子。叶片长圆披针形、椭圆披针形或倒卵状披针形，长7-15厘米，宽2-3.5厘米，"+
            "先端渐尖，基部宽楔形，上面无毛，下面在脉腋间具少数短柔毛或无毛，叶边具细锯齿或粗锯齿，齿端具腺体或无腺体；叶柄粗壮，长1-2厘米，常具1至数枚腺体，有时无腺体。",
            
            "紫叶李，别名：红叶李，蔷薇科李属落叶小乔木，高可达8米，原产亚洲西南部，中国华北及其以南地区广为种植。叶常年紫红色，著名观叶树种，孤植群植皆宜，能衬托背景。"+
            "尤其是紫色发亮的叶子，在绿叶丛中，像一株株永不败的花朵，在青山绿水中形成一道靓丽的风景线。灌木或小乔木，高可达8米；多分枝，枝条细长，开展，暗灰色，有时有棘刺；"+
            "小枝暗红色，无毛；冬芽卵圆形，先端急尖，有数枚覆瓦状排列鳞片，紫红色，有时鳞 片边缘有稀疏缘毛。叶片椭圆形、卵形或倒卵形，极稀椭圆状披针形，长（2）3-6厘米，"+
            "宽2-3（2）厘米，先端急尖，基部楔形或近圆形，边缘有圆钝锯 齿，有时混有重锯齿，上面深绿色，无毛，中脉微下陷，下面颜色较淡，除沿中脉有柔毛或脉腋有髯毛外，其余部分无毛，"+
            "中脉和侧脉均突起，侧脉5-8对；叶柄 长6-12毫米，通常无毛或幼时微被短柔毛，无腺；托叶膜质，披针形，先端渐尖，边有带腺细锯齿，早落。花1朵，稀2朵；花梗长1-2.2厘米。"+
            "无毛或微 被短柔毛；花直径2-2.5厘米；萼筒钟状，萼片长卵形，先端圆钝，边有疏浅锯齿，与萼片近等长，萼筒和萼片外面无毛，萼筒内面有疏生短柔毛.",
            
            "黄葛树，学名Ficus virens Ait. var. sublanceolata (Miq.) Corner，别名黄桷树、大叶榕树、马尾榕、雀树。它在佛经里被称之为神圣的菩提树，"+
            "旧时风俗，在我国西南一带，黄葛树只能在寺庙、公共场合才能种植，家庭很少种植。 黄葛树属高大落叶乔木。其茎干粗壮，树形奇特，悬根露爪，蜿蜒交错，古态盎然。枝杈密集，"+
            "大枝横伸，小枝斜出虬曲。树叶茂密，叶片油绿光亮。寿命很长，百年以上大树比比皆是。花期5～8月，果期8～11月，果生于叶腋，球形，黄色或紫红色。"+
            "黄葛树树高15-20m。板根延伸达十米外，支柱根形成对干，胸围达3-5m。叶互生；叶柄长2.5-5cm；托叶广卵形，急尖，长5-10cm；叶片纸质，长椭圆形或近披针形，"+
            "长8-16cm，宽4-7cm，先端短渐尖，基部钝或圆开，全缘，基出脉3条，侧脉7-10对，网脉稍明显。其具有顽强的生命力，根深杆壮，枝繁叶茂，生长快，寿命长，忍高温，耐潮湿，抗污染。",
            
            "柳树种类多，容易杂交。杂种生长势和适应性强，易无性繁殖，可从天然或人工杂种群体内选择，通过无性繁殖，获得优良无性系品种；另外，也可用植物组织培养的方法快速获取大量优质树苗。"+
            "以园林观赏为主的育种，应重点改良其枝叶及树形，提高抗污染、耐修剪整形的能力。 柳树枝条细长而低垂，褐绿色，无毛；冬芽线形，密着于枝条。叶互生，线状披针形，长 7－15厘米，宽6－12厘米，"+
            "两端尖削，边缘具有腺状小锯齿，表面浓绿色，背面为绿灰白色，两面均平滑无毛，具有托叶。花开于叶后，雄花序为葇荑花序，有短梗，略弯曲，长1－1.5公分。果实为蒴果，成熟后2瓣裂，内藏种子多枚，"+
            "种子上具有一丛绵毛。插枝繁殖。对空气污染及尘埃的抵抗力强，适合于都市庭园中生长，尤其于水池或溪流边。叶的形状为线状披针形或狭披针形，长约6~14cm，宽约5~12mm，边缘有细锯齿。"+
            "每年的4--5月开花，葇荑花序，雄花序长2~4cm，雌花序长约2cm。",
            
            "梨花，蔷薇科梨属，梨树的花朵。梨树，落叶乔木，叶圆如大叶杨，干有粗皮外护，枝撑如伞。春季开花，花色洁白，如雪五出，具有强烈气味。果可供生食外，还可酿酒、制梨膏、梨脯，以及药用。"+
            "梨花在我国约有2000余年的栽培历史，种类及品种均较多,历史悠久，自古以来深受人们的喜爱，其素淡的芳姿更是博得诗人的推崇。原产我国，栽培遍及全国。梨在我国产量之盛，时间之长仅次于苹果。"+
            "如梨果治热咳，切片贴之治火伤；捣汁内服润肺凉心，解疮毒、酒毒。梨花能去面黑粉刺；梨叶煎服，治风寒和小儿寒疝，树皮能除结气咳逆等症，是一种极佳的药物。",
            
            "玉兰（Magnolia denudata Desr.），木兰科落叶乔木，别名白玉兰、望春、玉兰花。 原产于中国中部各省，现北京及黄河流域以南均有栽培。木兰科玉兰亚属，落叶乔木。花白色到淡紫红色，"+
            "大型、芳香，花冠杯状，花先开放，叶子后长，花期10天左右。落叶乔木，高达25米，胸径1米，枝广展形成宽阔的树冠；树皮深灰色，粗糙开裂；小枝稍粗壮，灰褐色；冬芽及花梗密被淡灰黄色长绢毛。"+
            "叶纸质，倒卵形、宽倒卵形或、倒卵状椭圆形，基部徒长枝叶椭圆形，长10-15（18）厘米，宽6-10 （12）厘米，先端宽圆、平截或稍凹，具短突尖，中部以下渐狭成楔形，叶上深绿色，嫩时被柔毛，"+
            "后仅中脉及侧脉留有柔毛，下面淡绿色，沿脉上被柔毛，侧脉每边8-10条，网脉明显；叶柄长1-2.5厘米，被柔毛，上面具狭纵沟；托叶痕为叶柄长的1/4-1/3。花蕾卵圆形，花先叶开放，直立，芳香，直径10-16厘米",
            
            "竹子，又名竹。学名 Bambusoideae（Bambusaceae或Bamboo），是禾本科的一个分支，分布在亚热带地区，又称竹类或竹子。有低矮似草，又有高如大树。通常通过地下匍匐的根茎成片生长。"+
            "也可以通过开花结籽繁衍，其种子被称为竹米。 竹叶呈狭披针形，长7.5～16厘米，宽1～2厘米，先端渐尖，基部钝形，叶柄长约5毫米，边缘之一侧较平滑，另一侧具小锯齿而粗糙；平行脉，次脉6～8对，"+
            "小横脉甚显著；叶面深绿色，无毛，背面色较淡，基部具微毛；质薄而较脆。竹笋长10至30cm，成年竹通体碧绿节数一般在10至15节之间。",
            
            "石榴（学名：Punica granatum L.）落叶乔木或灌木；单叶，通常对生或簇生，无托叶。花顶生或近顶生，单生或几朵簇生或组成聚伞花序，近钟形，裂片5-9，花瓣5-9，多皱褶，覆瓦状排列；胚珠多数。"+
            "浆果球形，顶端有宿存花萼裂片，果皮厚；种子多数，浆果近球形，果熟期9-10月。外种皮肉质半透明，多汁；内种皮革质。 树冠内分枝多，嫩枝有棱，多呈方形。小枝柔韧，不易折断。一次枝在生长旺盛的小枝上交错对生，"+
            "具小刺。刺的长短与品种和生长情况有关。旺树多刺，老树少刺。芽色随季节而变化，有紫、绿、橙三色。叶对生或簇生，呈长披针形至长圆形，或椭圆状披针形，长2-8cm，宽1-2cm，顶端尖，表面有光泽，背面中脉凸起；"+
            "有短叶柄。",
            
            "枫叶是枫树的叶子，一般为掌状五裂，长13厘米，宽略大于长，3片最大的裂片具少数突出的齿，基部为心形，叶面粗糙，上面为中绿至暗绿色，下面脉腋上有毛，秋季变为黄色至橙色或红色。但少量地区为深、暗绿色。"+
            "一般为掌状五裂（也有的品种是三裂），长13厘米，宽略大于长。3片最大的裂片具少数突出的齿，基部为心形。在春夏时节是绿色，到秋天会由于叶绿素减少、类胡萝卜素增多，导致枫叶呈橙黄或红色。"+
            "所有的树叶中都含有绿色的叶绿素，树木利用叶绿素捕获光能并且在叶子中其他物质的帮助下把光能以糖等化学物质的形式存储起来。除叶绿素外，很多树叶中还含有胡萝卜素、黄色色素、红色色素等其他的一些色素。"+
            "虽然这些色素不能像叶绿素一样进行光合作用，但是其中有一些能够把捕获的光能传递给叶绿素。在春天和夏天，叶绿素在叶子中的含量比其他色素要丰富得多，所以叶子呈现出叶绿素的绿色，而看不出其他色素的颜色。",
            
            "榕属植物，又称小叶榕。乔木，高15-20米，胸径25-40厘米。生于路旁溪边或山地疏林中。 产中国广东、广西、贵州、云南。根、叶、果实可入药。"+
            "乔木，高15-20米，胸径25-40厘米；树皮深灰色，有皮孔；小枝粗壮,无毛。叶狭椭圆形，长5-10厘米，宽1.5-4厘米，全缘，先端短尖至渐尖，基部楔形，两面光 滑无毛，干后灰绿色，基生侧脉短，侧脉4-8对，"+
            "小脉在表面明显；叶柄短，长约1- 2厘米；托叶披针形，无毛，长约1厘米。榕果成对腋生或3-4个簇生于无叶小枝叶腋， 球形，直径4-5毫米；雄花、瘿花、雌花同生于一榕果内壁；雄花极少数，生于榕果内 壁近口部，花被片2，"+
            "披针形，子房斜卵形，花柱侧生，柱头圆形；瘿花相似于雌花，花 柱线形而短；榕果无总梗或不超过0.5毫米。花果期3-6月。",
            
            "桑叶，（Mulberry Leaf），学名：Folium Mori。中药名，是桑科植物桑的干燥叶，又名家桑、荆桑、桑椹树、黄桑叶等，全国大部分地区多有生产，桑叶提取物脱氧野尻霉素与葛根提取类黄酮物质结合形成一种新物质——洗胰清糖素（cics），"+
            "适合用于治降血糖、血脂、抗炎等作用。 完整叶片呈卵形、宽卵形、心形等，长约15厘米，宽约10厘米，叶柄长约4厘米，叶片基部心脏形，顶端微尖，边缘有锯齿，叶脉密生白柔毛。老叶较厚黄绿色。嫩叶较薄，暗绿色。质脆易碎，握之扎手。气淡，味微苦涩。"+
            "药用一般认为霜后采者质佳。聚花果（桑椹）熟时紫黑色、红色或乳白色。花期4～5月，果期6～7月。",
            
            "杜英（拉丁学名Elaeocarpus decipiens Hemsl.），别名假杨梅、梅擦饭、青果、野橄榄、胆八树、橄榄、缘瓣杜英。杜英科杜英属常绿乔木，高可达15米，叶革质，披针形或倒披针形，边缘有小钝齿；叶柄初时有微毛，在结实时变秃净。"+
            "总状花序多生于叶腋，花序轴纤细，花白色，萼片披针形，花瓣倒卵形，花药顶端无附属物；核果椭圆形，外果皮无毛，内果皮坚骨质，花期6-7月。 常绿乔木，高5-15米；嫩枝及顶芽初时被微毛，不久变秃净，干后黑褐色。叶革质，披针形或倒披针形，"+
            "长7-12厘米，宽2-3.5厘米，上面深绿色，干后发亮，下面秃净无毛，幼嫩时亦无毛，先端渐尖，尖头钝，基部楔形，常下延，侧脉7-9对，在上面不很明显，在下面稍突起，网脉在上下两面均不明显，边缘有小钝齿；叶柄长1厘米，初时有微毛，在结实时变秃净。",
            
            "栀子花（Gardenia jasminoides Ellis），又名栀子、黄栀子，为茜草目、茜草科、栀子属的常绿灌木，喜欢温暖湿润和阳光充足的环境，较耐寒，耐半阴，怕积水，要求疏松、肥沃和酸性的沙壤土，原产于中国。栀子花枝叶繁茂，叶色四季常绿，花芳香素雅，"+
            "为重要的庭院观赏植物。叶对生，革质，稀为纸质，少为3枚轮生，叶形多样，通常为长圆状披针形、倒卵状长圆形、倒卵形或椭圆形，长3-25厘米，宽1.5-8厘米，顶端渐尖、骤然长渐尖或短尖而钝，基部楔形或短尖，两面常无毛，上面亮绿，下面色较暗；侧脉8-15对，"+
            "在下面凸起，在上面平；叶柄长0.2-1厘米；托叶膜质。"
	};
	static public double [][]data={{0.594422222,	0.639933333,	0.8622,	1.1398,	0.704155556	,0.565655556	,	0.543144444
	},
	{2.2338375	,0.7090125	,0.973425	,1.0483625,	0.7317375	,0.4346875	,	0.6571375
},
	{3.040955556	,0.692255556,	0.959591111	,1.049511111,	0.589722222	,0.319766667,		0.534677778,
},
	{1.62394	,0.73163,	0.9799,	1.04452	,0.85122,	0.5845,		0.78121
},
	{2.23148,	0.74266	,0.979153	,1.04483	,0.74937	,0.43651	,	0.68611
},
	{5.94556,	0.64777,	0.84596	,1.04284	,0.30215,	0.16644	,	0.27792
},
	{1.33393,	0.73775,	0.98025,	1.04833,	0.87649,	0.6838		,0.79802
},
	{1.487533333,	0.742022222	,0.983922222,	1.048088889	,0.871244444,	0.615011111,		0.793522222
},
	{5.8642	,0.7919	,0.960666667,	1.032811111	,0.379566667,	0.169666667	,	0.354488889
},
	{3.127333333,	0.662522222	,0.949888889,	1.044277778	,0.5573	,0.3107	,	0.509588889
},
	{0.998166667,	0.4773,	0.613966667	,1.487155556	,0.5566	,0.822011111,		0.253711111
},
	{1.524433333,	0.710233333	,0.979066667	,1.043655556	,0.830677778,	0.5855,		0.7627
},
	{1.350677778	,0.721311111,	0.967966667,	1.064811111	,0.855477778	,0.691433333	,	0.756833333
},
	{3.2319	,0.663416667,	0.9691	,1.04505	,0.56075	,0.3019	,0.5137
},
	{2.489525,	0.653125,	0.96445	,1.043875,	0.6439375	,0.3824125,0.6013875
}};
		
	//初始化数据库
    public void insertAndUpdateData(MySQLiteHelper myHelper){
    	SQLiteDatabase db=myHelper.getWritableDatabase();
    	ContentValues values=new ContentValues();
    	values.clear();
    	for(int i=0;i<15;i++){
    	    values.put("name", tdata[i]);
    	    values.put("introduction", intro[i]);
    	    for(int j=1;j<=7;j++){
    	    	double temp=data[i][j-1];
    	    	values.put("data"+j, temp);
    	    }
    	}
    	db.close();
    }
  //查询第num条数据记录，结果保存在result中
    static public String queryData(MySQLiteHelper myHelper,int num){
    	String result="";
    	SQLiteDatabase db=myHelper.getReadableDatabase();
    	Cursor cursor=db.query("test_info",null,null,null,null,null,"id asc");
    	
    	int nameIndex=cursor.getColumnIndex("name");
    	int introductionIndex=cursor.getColumnIndex("introduction");
    	int data1Index=cursor.getColumnIndex("data1");
    	int data2Index=cursor.getColumnIndex("data2");
    	int data3Index=cursor.getColumnIndex("data3");
    	int data4Index=cursor.getColumnIndex("data4");
    	int data5Index=cursor.getColumnIndex("data5");
    	int data6Index=cursor.getColumnIndex("data6");
    	int data7Index=cursor.getColumnIndex("data7");
    	int cnt=0;
    	for(cursor.moveToFirst();!cursor.isAfterLast();cursor.moveToNext()){
    		cnt++;
    		if(cnt==num){
    		    result=result+cursor.getString(nameIndex)+"#";
    		    result=result+cursor.getString(introductionIndex)+"#";
    		    result=result+cursor.getFloat(data1Index)+"#";
    		    result=result+cursor.getFloat(data2Index)+"#";
    		    result=result+cursor.getFloat(data3Index)+"#";
    		    result=result+cursor.getFloat(data4Index)+"#";
    		    result=result+cursor.getFloat(data5Index)+"#";
    		    result=result+cursor.getFloat(data6Index)+"#";
    		    result=result+cursor.getFloat(data7Index)+"\n";
    		}
    	}
    	cursor.close();
    	db.close();
    	return result;
    }
    public void onDestroy(){
    	SQLiteDatabase db=myHelper.getWritableDatabase();
		db.delete("test_info","1",null);
        super.onDestroy();
    }
}
